[
    {
        "identifier": "iphone-se",
        "link": "https://www.apple.com/iphone-se/",
        "name": "iPhone Special Edition (SE)",
        "image": "images/iphoneSE.png",
        "model": "iPhone SE",
        "brand": "Apple",
        "os": "iOS 13",
        "price": "€399",
        "screenDia": "4.7\"",
        "RAM": "3 GB",
        "internalMemory": "64 GB",
        "backCam": "12.0 Mpix",
        "batCapacity": "1821 mAh",
        "screenRes": "1334 x 750",
        "screenType": "IPS",
        "touchSensitive": "Yes",
        "numberOfColours": "(24-bit) 16.777.216 colours",
        "numOfCores": "6 (Hexa-core)",
        "processorType": "ARM",
        "processorDesc": "2 x 2.65 GHz Lightning + 4 x 1.8 GHz Thunder",
        "chipset": "Apple A13 Bionic (7 nm+)",
        "graphics": "Apple GPU",
        "internalMemoryExtensions": "No extension capability",
        "stabilization": "Electronic and Optic Stabilization (EIS/OIS)",
        "frontCamera": "7 Mpix",
        "wifi": "Yes",
        "bluetooth": "v5.0",
        "gps": "Yes",
        "gpsSpecs": "A-GPS, GLONASS",
        "nfc": "Yes",
        "fastCharge": "Yes",
        "keyboard": "Touch",
        "wirelessCharging": "Yes",
        "simSlot": "Single SIM",
        "simSlotType": "Nano SIM",
        "colours": "Black, White, Red",
        "twoG": "Yes",
        "threeG": "Yes",
        "fourG": "Yes",
        "dimensions": "138.4 x 67.3 x 7.3 mm",
        "weight": "148 g",
        "vidReview": "https://www.youtube.com/embed/MlyDCb-L1dc",
        "professionalReview": "The iPhone SE 2020 is built around one goal: to launch a new iPhone for less money than ever, and it achieves that well. For just $399 / £419 / AU$749 you can have a brand-new handset from Apple – it’s one of the best iPhones ever created and you can pick one up for less than half the price of a new flagship phone. The design of the phone is going to be familiar to anyone that’s used an iPhone recently – unless you’ve not held a handset from Apple since 2013, you’ll have seen this 4.7-inch frame before, complete with bezels top and bottom and a home button with a fingerprint scanner built in. It’s now seen as the ‘smaller’ iPhone form factor given the all-screen designs of the more recent models, and it’s both more lightweight and pocketable than anything from the iPhone 11 range.It’s pleasingly water resistant, but does have some drawbacks thanks to the older design: it lacks a headphone jack at the bottom, and because the display technology is slightly dated (as it comes from the iPhone 8) it can suffer in bright light when you’re trying to watch videos or the like. Apple might have stuck with the same design as the iPhone 8, but the innards are much improved – notably the new A13 Bionic chipset inside, which adds speed nearly everywhere and really does improve the performance over the older 4.7-inch models. It’s not quite at the level of the iPhones launched last year, but it’s not far off – and getting the latest silicon means the iPhone SE has years of IOS updates head of it. This is the phone to get if you just want a new iPhone that will last you a few years, but don’t want to pay a lot for it. The iPhone SE 2020 offers ‘decent but not top-end’ performance: a good camera, enough power, a great App Store to plunder and a lighter iPhone than recent models. Battery life and screen tech could be better, the headphone jack is a miss, but - for the price - this is one of the best iPhones Apple has ever made.",
        "professionalReviewOrigin": "https://www.techradar.com/reviews/iphone-se",
        "professionalReviewRating": "4 / 5",
        "comments": [
            {
                "rating": 5,
                "title": "Good phone!",
                "review": "Coolest phone I’ve ever had. The only thing I don’t like is minor: there’s no separate port for headphones. You have to use the same one as the charger.",
                "reply": ["Honestly, yeah. I agree with this man.", "Fake."],
                "likes": 2,
                "dislikes": 0
            },
            {
                "rating": 2,
                "title": "Phone is okay, Apple is terrible",
                "review": "Had phone for less than 2 months. Camera glass breaks after unknown mishandling. Apple won't claim it's a manufacturers defect. Got an estimate of 110 to replace. Don't buy Apple products.",
                "reply": ["How high did you drop it for the camera to break?"],
                "likes": 0,
                "dislikes": 0
            },
            {
                "rating": 4,
                "title": "Simply excellent",
                "review": "I bought this phone when it first came out and I've still got it. Sure, it has issues, and that's the reason it's not a 5, but I'm rather content. At the time of release, it was the best phone one could get. Simply superior. Though it hasn't aged as well as one could have hoped.",
                "reply": [],
                "likes": 3,
                "dislikes": 3
            },
            {
                "rating": 3,
                "title": "Ok",
                "review": "Not good, not bad. Just okay. A standard Apple product - Good quality for a big price.",
                "reply": [],
                "likes": 5,
                "dislikes": 2
            }
        ]
    },
    {
        "identifier": "p40-pro",
        "link": "https://consumer.huawei.com/en/phones/p40-pro/",
        "name": "Huawei P40 Pro",
        "image": "images/huaweiP40.png",
        "model": "P40 Pro",
        "brand": "Huawei",
        "os": "EMUI 10",
        "price": "€399",
        "screenDia": "6.58\"",
        "RAM": "8 GB",
        "internalMemory": "256 GB",
        "backCam": "50 Mpix + 12 Mpix + 40 Mpix + TOF 3D",
        "batCapacity": "4200 mAh",
        "screenRes": "2640 x 1200",
        "screenType": "OLED",
        "touchSensitive": "Yes",
        "numberOfColours": "(24-bit) 16.777.216 colours",
        "numOfCores": "8 (Octa-core)",
        "processorType": "ARM",
        "processorDesc": "2 x Cortex-A76 2.86 GHz + 2 x Cortex-A76 2.36 GHz + 4 x Cortex-A55 1.95 GHz",
        "chipset": "HUAWEI Kirin 990 5G",
        "graphics": "Mali-G76 MC16",
        "internalMemoryExtensions": "Huawei Nano Memory (NM), 256 GB (Uses SIM 2 Slot)",
        "stabilization": "Electronic and Optic Stabilization (EIS/OIS)",
        "frontCamera": "32.0 Mpix",
        "wifi": "Yes",
        "bluetooth": "v5.1",
        "gps": "Yes",
        "gpsSpecs": "GPS/AGPS/Glonass/QZSS/Galileo",
        "nfc": "Yes",
        "fastCharge": "Yes",
        "keyboard": "Touch",
        "wirelessCharging": "No",
        "simSlot": "Single SIM",
        "simSlotType": "Dual SIM",
        "colours": "Black, White, Gray",
        "twoG": "Yes",
        "threeG": "Yes",
        "fourG": "Yes",
        "dimensions": "158.2 x 72.6 x 8.95 mm",
        "weight": "209 g",
        "vidReview": "https://www.youtube.com/embed/tojOGG1Jj2c",
        "professionalReview": "If you want a Huawei P40 Pro badly enough, you’ll be able to make the most of this handset – it offers a luxurious design, long lasting battery life and one of the best cameras we’ve ever seen on a phone. For the average user, though, this isn’t a phone we’d recommend. Owing to the Huawei ban in the US, the phone doesn’t have Google Mobile Services, meaning the handset doesn’t have access to popular Android apps like the Google Play Store, YouTube, Gmail and a multitude of others. In our time with the Huawei P40 Pro, we found this to be frustrating and it bordered on defeating the object of having a smartphone in 2020. Not being able to access the services we use on Android devices every day hampered our experience of using the Huawei P40 Pro, and it’s likely you’d find the same. That said, the Huawei P40 Pro does offer a premium design that excels anything the company had made before, along with a high-resolution screen that’s a genuine joy to use. The Huawei P40 Pro’s hardware makes it the most polished and capable device the company has ever made, but the software experience cripples the handset. The lack of Google Mobile Services is a major problem for many would-be users, and while the camera, design and battery life are all first-rate, that Google-sized hole in the overall package means it’s a very difficult phone to recommend.",
        "professionalReviewOrigin": "https://www.techradar.com/reviews/huawei-p40-pro-review",
        "professionalReviewRating": "4 / 5",
        "comments": [
            {
                "rating": 4,
                "title": "Beautiful hardware, odd software",
                "review": "Huawei was trying to 2020-ify the device and it's done exactly that. Huawei has finally added a high-refresh-rate display to one of its flagships. The P40 Pro's 90Hz AMOLED panel looks great. Despite its middling resolution compared to the competition, this looks like the best screen ever fitted to a Huawei device.",
                "reply": [],
                "likes": 3,
                "dislikes": 2
            },
            {
                "rating": 3,
                "title": "Lack of Google hurts",
                "review": "I originally thought it wouldn't be that bad but damn, I was quite wrong. The lack of an actual play store and instead using the chinese one has made me want to return the phone on several occassions. Still, it's performance is unmatched for its price.",
                "reply": [],
                "likes": 1,
                "dislikes": 2
            }
        ]
    },
    {
        "identifier": "samsung-a70",
        "link": "https://www.samsung.com/rs/smartphones/galaxy-a70-a705/SM-A705FZOUSEE/",
        "name": "Samsung Galaxy A70",
        "image": "images/A70.png",
        "model": "A70",
        "brand": "Samsung",
        "os": "Android 9",
        "price": "€389",
        "screenDia": "6.7\"",
        "RAM": "6 GB",
        "internalMemory": "128 GB",
        "backCam": "32.0 Mpix + 8.0 Mpix + 5.0 Mpix",
        "batCapacity": "4500 mAh",
        "screenRes": "2400 x 1080",
        "screenType": "Super AMOLED",
        "touchSensitive": "Yes",
        "numberOfColours": "(24-bit) 16.777.216 colours",
        "numOfCores": "8 (Octa-core)",
        "processorType": "ARM",
        "processorDesc": "2 x 2.0 GHz Kryo 460 Gold & 6 x 1.7 GHz Kryo 460 Silver",
        "chipset": "Qualcomm SDM675 Snapdragon 675 (11 nm)",
        "graphics": "Adreno 612",
        "internalMemoryExtensions": "microSD up to 51twoGB",
        "stabilization": "Electronic and Optic Stabilization (EIS/OIS)",
        "frontCamera": "32.0 Mpix",
        "wifi": "Yes",
        "bluetooth": "v5.0",
        "gps": "Yes",
        "gpsSpecs": "GPS, Glonass, Beidou, Galileo",
        "nfc": "Yes",
        "fastCharge": "Yes",
        "wirelessCharging": "Yes",
        "keyboard": "Touch",
        "simSlot": "Dual SIM",
        "simSlotType": "1 Nano SIM + 1 Nano SIM + Micro SD",
        "colours": "Black, Blue, Coral (Orange), White",
        "twoG": "Yes",
        "threeG": "Yes",
        "fourG": "Yes",
        "dimensions": "164.3 x 76.7 x 7.9 mm",
        "weight": "183 g",
        "vidReview": "https://www.youtube.com/embed/ITqmxZbBP7o",
        "professionalReview": "Samsung’s sixth phone in its refreshed Galaxy A series, the Galaxy A70 is aimed at millennials according to the company. The phone features one of the biggest display by Samsung and has a huge battery to back it up. While the Galaxy A50 was strictly a mid-range smartphone and a step in the right direction, the A70 takes the fight to more premium phones like the Vivo V15 Pro, Oppo F11 Pro, POCO F1 and Nokia 8.1 among others. Samsung Galaxy A70 uses a 6.7-inch Super AMOLED panel which is tall and vivid with a Full HD+ (2400 x 1080 pixels) resolution. The screen has a u-shaped cutout for the selfie camera housing which gives it a 20:9 aspect ratio. The display on the A70 can get really bright with vibrant colour reproduction and deep blacks. The size of the screen makes it one of the better phones to consume videos or binge-watch the latest show on Netflix. Samsung Galaxy A70 comes with three rear cameras, consisting of a main 32MP (f/1.7) snapper, an 8MP (f/2.2) ultra-wide angle camera with 123-degree lens and a 5MP (f/2.2) depth camera for portrait mode. On the front, selfie fans will be happy with the 32MP (f/2.0) front-facing camera. Through our tests, the camera received an update which improves the image quality and adds beauty mode in videos taken from rear camera. The Samsung Galaxy A70 has a bright and vivid display which makes it one of the best phones for multimedia coupled with a humongous battery that lasts longer than ever. Users looking for a neatly balanced phone, the A70 is where you should be looking at.",
        "professionalReviewOrigin": "https://www.techradar.com/reviews/samsung-galaxy-a70-hands-on",
        "professionalReviewRating": "5 / 5",
        "comments": [
            {
                "rating": 5,
                "title": "Beautiful phone for affordable price",
                "review": "Beautiful phone design. Works on T-Mobile fourG LTE. Love it!",
                "reply": [],
                "likes": 4,
                "dislikes": 2
            },
            {
                "rating": 5,
                "title": "Awesome phone for the price",
                "review": "I really like this phone, it's really large though, but other that that it's perfect! I have at&t and haven't had any issues with it yet.",
                "reply": [],
                "likes": 3,
                "dislikes": 0
            }
        ]
    },
    {
        "identifier": "iphone-11-pro-max",
        "link": "https://www.apple.com/shop/buy-iphone/iphone-11",
        "name": "iPhone 11 Pro Max",
        "image": "images/iphone11.png",
        "model": "iPhone 11 Pro Max",
        "brand": "Apple",
        "os": "iOS 14",
        "price": "€949",
        "screenDia": "6.5\"",
        "RAM": "4 GB",
        "internalMemory": "64 GB",
        "backCam": "12 Mpix + 12 Mpix + 12 Mpix",
        "batCapacity": "3969 mAh",
        "screenRes": "2688 x 1242",
        "screenType": "OLED",
        "touchSensitive": "Yes",
        "numberOfColours": "(24-bit) 16.777.216 colours",
        "numOfCores": "6 (Hexa-core)",
        "processorType": "ARM",
        "processorDesc": "Hexa-core (2x2.65 GHz Lightning + 4x1.8 GHz Thunder)",
        "chipset": "Apple A13 Bionic (7 nm+)",
        "graphics": "4 cores",
        "internalMemoryExtensions": "No extension capability",
        "stabilization": "Electronic and Optic Stabilization (EIS/OIS",
        "frontCamera": "12.0 Mpix",
        "wifi": "Yes",
        "bluetooth": "v5.0",
        "gps": "Yes",
        "gpsSpecs": "Integrated GPS/GNSS Digital Compass iBeacon microlocation",
        "nfc": "Yes",
        "fastCharge": "Yes",
        "wirelessCharging": "Yes",
        "keyboard": "Touch",
        "simSlot": "Single SIM",
        "simSlotType": "Nano SIM",
        "colours": "Black, White, Red",
        "twoG": "Yes",
        "threeG": "Yes",
        "fourG": "Yes",
        "dimensions": "158 x 77.8 x 8.1 mm",
        "weight": "148 g",
        "vidReview": "https://www.youtube.com/embed/Cjdmc3JKgq4",
        "professionalReview": "The iPhone 11 Pro Max is the largest and most powerful phone Apple’s ever created, taking the very best of its technology and combining it with an upgraded design that includes a new matte back, three cameras designed to rival the best from Samsung, Google and Huawei, and an enhanced battery for greater endurance. However, it’s also one of the most expensive phones on the market as the much more powerful member of the iPhone 11 series. Digging deeper into the camera, we’re impressed most with the Night mode: the iPhone 11 Pro Max is capable of turning night almost into day, but doing so while preserving plenty of detail. We found the newly-added ultra-wide camera to be handy when you want to squeeze in more of a scene (although we didn’t find we needed it that often) and for improving the background defocus effects… although it still wasn’t perfect in our testing. The design of the iPhone 11 Pro Max will be familiar to most, with the same design language as the previous two models (the iPhone X and iPhone XS), although the matte back feels nice in the hand. The 'Max' size won’t appeal to all, but it does facilitate the large and impressive 6.5-inch OLED display, which offers a brilliant cinematic experience, both visually and through the upgraded stereo speakers. The iPhone 11 Pro Max is the best that Apple can cram into a smartphone - the high-end screen, powerful speakers, upgraded processor all support the huge upgrades to the camera. However, this phone is really for the Apple fan or someone that really needs that extra lens or a touch more battery life - the iPhone 11 feels like it offers better value.",
        "professionalReviewOrigin": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
        "professionalReviewRating": "5 / 5",
        "comments": []
    }
]